Задание 1

In [5]:
import pandas as pd

In [7]:
authors = pd.DataFrame({"Author_id":[1, 2,3], "Author_name":['Тургенев', 'Чехов', 'Островский']})
authors

   Author_id Author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [8]:
book = pd.DataFrame({"Author_id":[1, 1, 1, 2, 2, 3, 3], "book_title":
                    ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    "price":[450, 300, 350, 500, 450, 370, 290]})
book

   Author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [9]:
author_price = pd.merge(authors, book, on = "Author_id", how = "inner")
author_price

   Author_id Author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [10]:
top5 = author_price.nlargest(5, "price")
top5

   Author_id Author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350